[
  {
    "id": 1000,
    "product_name": "iPhone 14 Pro",
    "product_image": "https://cdn.tmobile.com/content/dam/t-mobile/en-p/cell-phones/apple/Apple-iPhone-14-Pro/Deep-Purple/Apple-iPhone-14-Pro-Deep-Purple-thumbnail.png",
    "seller_name": "Apple",
    "product_price": 400,
    "category": "electronic",
    "description": "Mollit nostrud pariatur elit sunt esse aliqua occaecat dolore consectetur amet nulla sit ipsum. Occaecat qui veniam anim duis anim proident est. Est laboris consequat laborum fugiat proident enim deserunt consectetur ipsum ullamco ipsum. Nostrud consequat irure excepteur ea do consequat enim non esse. Nulla ex veniam fugiat laboris tempor duis anim aliqua."
  },
  {
    "id": 1001,
    "product_name": "iPhone 12",
    "product_image": "https://static.skyassets.com/contentstack/assets/blt143e20b03d72047e/bltab2d565224fbb987/6319db02937b9657b5f2b803/Carousel_iPhone14_Blue_Placement01-PreOrder.png",
    "seller_name": "Apple",
    "product_price": 250,
    "category": "electronic",
    "description": "Esse laborum voluptate anim labore cupidatat nostrud voluptate sint mollit dolor in eu. Nulla velit proident eu fugiat ut aliqua nostrud qui irure. Magna reprehenderit pariatur dolor officia laborum elit cupidatat nulla do cupidatat anim. Veniam veniam excepteur anim excepteur. Dolor deserunt incididunt ex excepteur amet fugiat. Officia nulla cupidatat occaecat sint dolor ut ea cillum. Labore consequat nisi velit exercitation."
  },
  {
    "id": 1002,
    "product_name": "ThinkPhone",
    "product_image": "https://motorolaus.vtexassets.com/arquivos/ids/162812/thinkphone-pdp-ecom-render-1-carbon-black-n5re8wvk.png?v=638084623518870000",
    "seller_name": "Motorola",
    "product_price": 150,
    "category": "electronic",
    "description": "Adipisicing officia veniam mollit proident amet officia ex ea duis deserunt. Dolore incididunt veniam tempor non tempor do veniam. Enim nisi duis mollit nulla amet excepteur officia dolor eiusmod eiusmod labore."
  },
  {
    "id": 1003,
    "product_name": "RedMi Note 12",
    "product_image": "https://i02.appmifile.com/373_operatorx_operatorx_opx/10/05/2023/657e399a69e188fb194c3804f33fb67d!380x380.png",
    "seller_name": "Xiaomi",
    "product_price": 175,
    "category": "electronic",
    "description": "Nisi fugiat magna anim ea officia aliquip minim ipsum non laborum sunt. Duis fugiat cillum aliqua reprehenderit officia magna ut nisi nisi adipisicing. Fugiat tempor adipisicing nulla do quis mollit tempor laborum ad magna aliqua est consequat aute. Exercitation velit aliquip cillum laborum. Adipisicing eiusmod qui proident aliquip anim laboris voluptate enim. Officia ea id aliquip reprehenderit do deserunt amet sunt ea occaecat amet id magna."
  },
  {
    "id": 1004,
    "product_name": "Galaxy S23 Ultra",
    "product_image": "https://cdn.vodafone.co.uk/en/assets/images/desktop/Samsung_Galaxy_S23_Ultra_green-full-product-front-600.png",
    "seller_name": "Samsung",
    "product_price": 100,
    "category": "electronic",
    "description": "Cillum culpa adipisicing nisi veniam. Officia labore adipisicing in officia quis dolor cillum amet incididunt veniam dolore fugiat exercitation. Sit dolore id dolore esse. Nostrud in ipsum ex ad labore irure ad. Ex cupidatat consequat pariatur tempor et fugiat ipsum reprehenderit in nostrud. Fugiat irure incididunt cupidatat dolor Lorem."
  },
  {
    "id": 1005,
    "product_name": "Pixel 7",
    "product_image": "https://cdn.vodafone.co.uk/en/assets/images/desktop/Google_Pixel_7_lemongrass-full-product-front-600.png",
    "seller_name": "Google",
    "product_price": 120,
    "category": "electronic",
    "description": "Deserunt sint enim Lorem ad exercitation sint ex pariatur ex mollit consectetur. Labore eu dolor ut proident in Lorem sint velit. Pariatur cupidatat Lorem officia dolore ea velit. Proident qui labore commodo nostrud enim deserunt aliqua dolor excepteur amet cillum ut. Id esse non cillum elit exercitation sunt veniam adipisicing sit. Et pariatur quis veniam nostrud proident veniam sint occaecat sit id dolor adipisicing."
  },
  {
    "id": 1006,
    "product_name": "Xperia 10 IV",
    "product_image": "https://cdn.vodafone.co.uk/en/assets/images/desktop/Sony_Xperia_10_IV_black-full-product-front-600.png",
    "seller_name": "Sony",
    "product_price": 150,
    "category": "electronic",
    "description": "Culpa elit nisi sunt aliqua elit eu exercitation velit consectetur velit. Magna laborum qui laboris do tempor consequat Lorem irure nulla commodo deserunt. Voluptate officia labore consequat labore exercitation anim velit ipsum consectetur velit. Ipsum fugiat quis cillum eu Lorem consectetur tempor et irure. Mollit cupidatat veniam deserunt mollit pariatur et amet. In reprehenderit ad Lorem sunt et pariatur in nostrud in sint aliqua do non. Amet incididunt voluptate id mollit duis."
  },
  {
    "id": 1007,
    "product_name": "Razr 40 Ultra",
    "product_image": "https://cdn.vodafone.co.uk/en/assets/images/desktop/Motorola_Razr_40_Ultra_infinite_black-full-product-front-600-v2.png",
    "seller_name": "Motorola",
    "product_price": 124,
    "category": "electronic",
    "description": "Officia aliquip enim veniam eu non dolore ipsum duis duis non nostrud. Ex consectetur pariatur quis elit dolore ad cillum deserunt proident aute. Amet ex anim commodo aliquip laboris qui cupidatat ullamco. Labore exercitation et occaecat anim minim reprehenderit. Anim minim Lorem deserunt Lorem culpa id magna elit. Nisi laborum qui consequat non aliquip adipisicing esse tempor qui irure deserunt ad tempor elit."
  },
  {
    "id": 1008,
    "product_name": "Magic4 PRO",
    "product_image": "https://cdn.vodafone.co.uk/en/assets/images/desktop/HONOR_Magic4_PRO_black-full-product-front-600.png",
    "seller_name": "HONOR",
    "product_price": 105,
    "category": "electronic",
    "description": "Laborum tempor sit irure laborum veniam incididunt exercitation esse in laboris culpa. Laboris duis eu esse nulla quis do nisi esse labore ea cupidatat tempor ad. Magna ut minim et commodo consequat ipsum. Proident laboris aute ut ex exercitation cupidatat do aliqua officia cupidatat non deserunt quis ea."
  }
]
